'''
Дано текстовий файл f. Переписати у файл g всі рядкиз вихідного файлу.
Порядок рядків замінити на зворотній.

Олійник Богдан Сергійович 122/Д
'''
import random                                                               #використаємо рандом для того список заповнював файли 
list = ['smash', 'seek', 'even', 'excite', 'injured',
        'candy', 'strain', 'emergency', 'safely',
        'awake', 'sail', 'fasten', 'interruption']
f = open("f.txt", "wt")                                                     # Файл відкриється у режимі запису текста 
for i in range(random.randint(5, 10)):                                      # файл циклічно записує рядки 
    f.write(random.choice(list)+'\n')
f.close()                                                                   # Файл закриється 
f = open("f.txt", "rt")                                                     # файл відкириється у режимі читання 
l = reversed(f.readlines())                                                 # всі рядки списка виписуються і стають в зворотній порядок 
g = open("g.txt", "wt")                                                     # файл відкриється у режимі запису текста
for j in l:                                                                 # файл циклічно записує рядки 
    g.write(j)                                                                         
f.seek(0)
print(f'File C:\n{f.read()}')                                               # на екран виводиться вміст файлу 
f.close()                                                                   # файл закриється 
g.close()                                                                   # файл закриється 
g = open("g.txt", "rt")                                                     # файл відкриється у режимі читання тексту 
print(f'File C:\n{g.read()}')                                               # на екран виводиться вміст файлу 
g.close()                                                                   # файл закриється 
