'''
Дано файл f, компоненти якого є цілими числами. Знайти кількість парних та кількість двозначних чисел серед компонентів файлу.
Результат вивести на екран.

Олійник Богдан Сергійович 122\Д
'''
import random
f = open("f.txt", "wt")                                         # Файл відкриється у режимі запису тексту 
for i in range(random.randint(10, 100)):                        # файл циклічно записує цілі числа і міняє їх на строковий тип даних str
    f.write(str(random.randint(0, 500))+'\n')
f.close()                                                       # файл закриється 
f = open("f.txt", "rt")                                         # файл відкривається у режимі читання тексту 
l = list(map(int, f.readlines()))                               # файл виписує рядки у список і міняє тип даних на int
x, y, z = 0, 0, 0                                               
for i in l:                                                     
    if 10 <= i <= 99:                                           # перевіряємо чи є чиcло двозначним
        x += 1
    if i % 2 == 0:                                              # перевіряєм чи є число парним
        y += 1
    if 10 <= i <= 99 and i % 2 == 0:                            # перевіряєм чи є число парним і двозначним
        z += 1
print(f'Кількість парних чисел: {x}\nКількість двоцифрових чисел: {y}\nКількість парних двоцифрових чисел: {z}')
